content/posts/20250322-zsa_pro_reds/index.md
+++
title = "ZSA Voyager with Pro Red Switches"
featuredImage = "20250322-zsa_pro_reds.jpg"
date = 2025-03-22
lastmod = 2025-03-22T12:42:58+11:00
tags = ["Keyboards", "AltKeyboardLayouts"]
categories = ["Blog"]
draft = false
weight = 3001
author = "Matt Maguire"
+++

I have been so impressed with my [ZSA Voyager keyboard]({{< relref "20240831_zsa-voyager-has-arrived" >}}) that I decided to buy a second one that I could leave set up at work. That meant I needed to think about what configuration to order.


## Switches {#switches}

On my previous Voyager, I ordered it with the Choc Red 50g linear switches, which felt very smooth, but possibly a little on the heavy side for me. So, I decided to try swapping them out with some [Ambient Twilight]({{< relref "index.en.md" >}}) 35g silent linear switches. I love those switches with their light touch and soft padding at the bottom of their travel.

However, ZSA don't offer the Ambient switches as an option. I decided to order the new keyboard with the Choc Pro Red 35g linear switches, which have the same weight as the Ambient Twilights but without the sound damping/cushioning. I figured if I didn't like them, then I'd order another set of Twilights from a local supplier.

When the new keyboard arrived, it only took a minute to update the firmware with my Graphite-like layout using ZSA's [Oryx web configuration tool](https://configure.zsa.io/voyager/layouts/34PvY/latest/0). I was a little worried because I had read an online comment that the Pro Reds might feel a little "sloppy" or "mushy" compared to the Twilights. However, I didn't find that at all. The feeling is very similar to the Twilights except for the nice "clacking" sound and firmer feel at the end of the travel. If I was to order another Voyager I would definitely choose the Pro Reds again. I might at some stage get some more Twilights, but for now I'm quite happy sticking with the Pro Reds.


## Keycaps {#keycaps}

The next decision was the type of key caps to order. On my other keyboard I ordered the blank keycaps because I wasn't sure which layout I would land on, and I wanted to encourage myself to touch-type. I have now pretty much settled on the [Graphite keyboard layout]({{< relref "20241229_graphite-keyboard-layout" >}}), which drove me to order another set of blank keycaps. Why? Well, I really like the bumps on the keycaps of the homerow index fingers. If I ordered keycaps with letters on them, then the only keycaps with bumps are QWERTY (_F_ and _J_), COLEMAK (_T_ and _N_) and DVORAK (_U_ and _H_). So, it was a bit of a no-brainer to go for blank keycaps again. Having decided that, I also went for the same colour keyboard as my first one so that I could interchange keycaps between the two keyboards should that be necessary.

Notice in the photo of the new keyboard I have replaced some of the blank caps with "special" keycaps provided as part of the blank keycap set. These aren't really needed at all, but may be helpful when trying to remember what functions I allocated to the outside row, and also on those occasions I try to use the keyboard when not in a proper touch-typing posture. The led lights also provide some hints, such as the location of the arrow keys on the navigation layer.


## Layout {#layout}

As I just mentioned, I am pretty happy with my current Graphite layout, so I simply loaded that onto the new keyboard. However, one of the problems with that layout is that the modifiers and layer switching keys become a problem when playing games. Not that I play a lot of games, but I thought it was worth addressing the problem anyway. The solution was to come up with two "sticy" gaming layers that don't have any modifiers or layer switchers on the letter keys -- ond Graphite and the other QWERTY. Then the problem becomes, "how to enter and leave these new layers?".

The solution I came up with was to use Combo keys on the number row at the top.

-   To switch to QWERTY gaming, press "5" and "6" together.
-   To switch to Graphite gaming, press "5" and "7" together
-   To go back to normal, press "5" and "6" together

So far I haven't noticed any false triggering, so I think this setup should be ok. For more detail on how I have set up my layers and combo keys, check out my [Oryx configuration page](https://configure.zsa.io/voyager/layouts/34PvY/latest/0), and feel free to clone it if you think it may be useful to you.
